waybyte/arduino_logicrom/boards.txt
# Copyright (c) Waybyte Solutions. All right reserved.
# https://waybyte.in/
#

menu.debug=Build Type
menu.stdio=Select STDIO Port

## Waybyte logicrom Boards
##########################

# Logicrom Spark LTE
sparklte.name=Waybyte Logicrom Spark LTE-G

# build
sparklte.build.core=logicrom
sparklte.build.cpu=arm
sparklte.build.f_cpu=500000000
sparklte.build.board=WAYBYTE_LOIGCROM_SPARK
sparklte.build.mcu=rda8910
sparklte.build.variant=ec200u
sparklte.build.vid=0x1782
sparklte.build.pid=0x4D11
sparklte.build.extra_flags=-DSOC_RDA8910=1 -DPLATFORM_EC200U=1 -DPLATFORM_LOGICROM_SPARK=1
sparklte.build.logicromlib=logicrom4g
sparklte.build.ldscript=linkerscript_rda.ld
sparklte.menu.debug.Release=Release
sparklte.menu.debug.Release.build.build_type=
sparklte.menu.debug.Debug=Debug
sparklte.menu.debug.Debug.build.build_type=_debug
sparklte.menu.stdio.none=None
sparklte.menu.stdio.none.build.stdio_port=
sparklte.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
sparklte.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
sparklte.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
sparklte.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
sparklte.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
sparklte.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
sparklte.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
sparklte.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
sparklte.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
sparklte.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
sparklte.upload.tool=logicromflasher_rda8910
sparklte.upload.protocol=logicromflasher
sparklte.upload.maximum_size=1048576
sparklte.upload.maximum_ram_size=524288
sparklte.upload.speed=460800
sparklte.upload.require_upload_port=false
sparklte.upload.wait_for_upload_port=false

## RDA8910 Boards
#################

# Quectel EC200U Module definition
ec200u.name=Quectel EC200U LTE Cat.1 Module

# build
ec200u.build.core=logicrom
ec200u.build.cpu=arm
ec200u.build.f_cpu=500000000
ec200u.build.board=QUECTEL_EC200U
ec200u.build.mcu=rda8910
ec200u.build.variant=ec200u
ec200u.build.vid=0x1782
ec200u.build.pid=0x4D11
ec200u.build.extra_flags=-DSOC_RDA8910=1 -DPLATFORM_EC200U=1
ec200u.build.logicromlib=logicrom4g
ec200u.build.ldscript=linkerscript_rda.ld
ec200u.menu.debug.Release=Release
ec200u.menu.debug.Release.build.build_type=
ec200u.menu.debug.Debug=Debug
ec200u.menu.debug.Debug.build.build_type=_debug
ec200u.menu.stdio.none=None
ec200u.menu.stdio.none.build.stdio_port=
ec200u.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
ec200u.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
ec200u.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
ec200u.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
ec200u.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
ec200u.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
ec200u.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
ec200u.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
ec200u.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
ec200u.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
ec200u.upload.tool=logicromflasher_rda8910
ec200u.upload.protocol=logicromflasher
ec200u.upload.maximum_size=1048576
ec200u.upload.maximum_ram_size=524288
ec200u.upload.speed=460800
ec200u.upload.require_upload_port=false
ec200u.upload.wait_for_upload_port=false

# Quectel EC600U Module definition
ec600u.name=Quectel EC600U LTE Cat.1 Module

# build
ec600u.build.core=logicrom
ec600u.build.cpu=arm
ec600u.build.f_cpu=500000000
ec600u.build.board=QUECTEL_EC600U
ec600u.build.mcu=rda8910
ec600u.build.variant=ec600u
ec600u.build.vid=0x1782
ec600u.build.pid=0x4D11
ec600u.build.extra_flags=-DSOC_RDA8910=1 -DPLATFORM_EC600U=1
ec600u.build.logicromlib=logicrom4g
ec600u.build.ldscript=linkerscript_rda.ld
ec600u.menu.debug.Release=Release
ec600u.menu.debug.Release.build.build_type=
ec600u.menu.debug.Debug=Debug
ec600u.menu.debug.Debug.build.build_type=_debug
ec600u.menu.stdio.none=None
ec600u.menu.stdio.none.build.stdio_port=
ec600u.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
ec600u.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
ec600u.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
ec600u.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
ec600u.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
ec600u.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
ec600u.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
ec600u.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
ec600u.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
ec600u.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
ec600u.upload.tool=logicromflasher_rda8910
ec600u.upload.protocol=logicromflasher
ec600u.upload.maximum_size=1048576
ec600u.upload.maximum_ram_size=524288
ec600u.upload.speed=460800
ec600u.upload.require_upload_port=false
ec600u.upload.wait_for_upload_port=false

# Quectel EG915U Module definition
eg915u.name=Quectel EG915U LTE Cat.1 Module

# build
eg915u.build.core=logicrom
eg915u.build.cpu=arm
eg915u.build.f_cpu=500000000
eg915u.build.board=EG915U
eg915u.build.mcu=rda8910
eg915u.build.variant=eg915u
eg915u.build.vid=0x1782
eg915u.build.pid=0x4D11
eg915u.build.extra_flags=-DSOC_RDA8910=1 -DPLATFORM_EG915U=1
eg915u.build.logicromlib=logicrom4g
eg915u.build.ldscript=linkerscript_rda.ld
eg915u.menu.debug.Release=Release
eg915u.menu.debug.Release.build.build_type=
eg915u.menu.debug.Debug=Debug
eg915u.menu.debug.Debug.build.build_type=_debug
eg915u.menu.stdio.none=None
eg915u.menu.stdio.none.build.stdio_port=
eg915u.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
eg915u.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
eg915u.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
eg915u.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
eg915u.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
eg915u.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
eg915u.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
eg915u.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
eg915u.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
eg915u.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
eg915u.upload.tool=logicromflasher_rda8910
eg915u.upload.protocol=logicromflasher
eg915u.upload.maximum_size=1048576
eg915u.upload.maximum_ram_size=524288
eg915u.upload.speed=460800
eg915u.upload.require_upload_port=false
eg915u.upload.wait_for_upload_port=false

# Neoway N716 Module definition
n716.name=Neoway N716 LTE Cat.1 Module

# build
n716.build.core=logicrom
n716.build.cpu=arm
n716.build.f_cpu=260000000
n716.build.board=NEOWAY_N716
n716.build.mcu=rda8910
n716.build.variant=n716
n716.build.vid=0x0E8D
n716.build.pid=0x0003
n716.build.extra_flags=-DSOC_RDA8910=1 -DPLATFORM_N716=1
n716.build.logicromlib=logicrom4g
n716.build.ldscript=linkerscript_rda.ld
n716.menu.debug.Release=Release
n716.menu.debug.Release.build.build_type=
n716.menu.debug.Debug=Debug
n716.menu.debug.Debug.build.build_type=_debug
n716.menu.stdio.none=None
n716.menu.stdio.none.build.stdio_port=
n716.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
n716.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
n716.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
n716.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
n716.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
n716.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
n716.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
n716.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
n716.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
n716.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

