waybyte/arduino_logicrom/boards.txt
# upload
n716.upload.tool=logicromflasher_rda8910
n716.upload.protocol=logicromflasher
n716.upload.maximum_size=1048576
n716.upload.maximum_ram_size=524288
n716.upload.speed=460800
n716.upload.require_upload_port=false
n716.upload.wait_for_upload_port=false

# Neoway N58 Module definition
n58.name=Neoway N58 LTE Cat.1 Module

# build
n58.build.core=logicrom
n58.build.cpu=arm
n58.build.f_cpu=500000000
n58.build.board=NEOWAY_N58
n58.build.mcu=rda8910
n58.build.variant=n58
n58.build.vid=0x1782
n58.build.pid=0x4D11
n58.build.extra_flags=-DSOC_RDA8910=1 -DPLATFORM_N58=1
n58.build.logicromlib=logicrom4g
n58.build.ldscript=linkerscript_rda.ld
n58.menu.debug.Release=Release
n58.menu.debug.Release.build.build_type=
n58.menu.debug.Debug=Debug
n58.menu.debug.Debug.build.build_type=_debug
n58.menu.stdio.none=None
n58.menu.stdio.none.build.stdio_port=
n58.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
n58.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
n58.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
n58.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
n58.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
n58.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
n58.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
n58.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
n58.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
n58.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
n58.upload.tool=logicromflasher_rda8910
n58.upload.protocol=logicromflasher
n58.upload.maximum_size=1048576
n58.upload.maximum_ram_size=524288
n58.upload.speed=460800
n58.upload.require_upload_port=false
n58.upload.wait_for_upload_port=false

# Fibocom L610 Module definition
l610.name=Fibocom L610 LTE Cat.1 Module

# build
l610.build.core=logicrom
l610.build.cpu=arm
l610.build.f_cpu=500000000
l610.build.board=QUECTEL_EC200U
l610.build.mcu=rda8910
l610.build.variant=ec200u
l610.build.vid=0x1782
l610.build.pid=0x4D11
l610.build.extra_flags=-DSOC_RDA8910=1 -DPLATFORM_L610=1
l610.build.logicromlib=logicrom4g
l610.build.ldscript=linkerscript_rda.ld
l610.menu.debug.Release=Release
l610.menu.debug.Release.build.build_type=
l610.menu.debug.Debug=Debug
l610.menu.debug.Debug.build.build_type=_debug
l610.menu.stdio.none=None
l610.menu.stdio.none.build.stdio_port=
l610.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
l610.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
l610.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
l610.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
l610.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
l610.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
l610.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
l610.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
l610.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
l610.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
l610.upload.tool=logicromflasher_rda8910
l610.upload.protocol=logicromflasher
l610.upload.maximum_size=1048576
l610.upload.maximum_ram_size=524288
l610.upload.speed=460800
l610.upload.require_upload_port=false
l610.upload.wait_for_upload_port=false

## ASR160x Boards
#################

# Quectel EC100N Module
ec100n.name=Quectel EC100N (ASR1603) LTE Cat.1 Module

# build
ec100n.build.core=logicrom
ec100n.build.cpu=arm
ec100n.build.f_cpu=416000000
ec100n.build.board=EC100N
ec100n.build.mcu=asr1603
ec100n.build.variant=asr160x
ec100n.build.vid=0x2ECC
ec100n.build.pid=0x3015
ec100n.build.flashsz=16M
ec100n.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1603=1 -DPLATFORM_EC100N=1
ec100n.build.logicromlib=logicromasr
ec100n.build.ldscript=linkerscript_asr.ld
ec100n.menu.debug.Release=Release
ec100n.menu.debug.Release.build.build_type=
ec100n.menu.debug.Debug=Debug
ec100n.menu.debug.Debug.build.build_type=_debug
ec100n.menu.stdio.none=None
ec100n.menu.stdio.none.build.stdio_port=
ec100n.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
ec100n.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
ec100n.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
ec100n.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
ec100n.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
ec100n.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
ec100n.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
ec100n.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
ec100n.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
ec100n.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
ec100n.upload.tool=logicromflasher_asr160x
ec100n.upload.protocol=logicromflasher
ec100n.upload.maximum_size=1048576
ec100n.upload.maximum_ram_size=524288
ec100n.upload.speed=460800
ec100n.upload.require_upload_port=false
ec100n.upload.wait_for_upload_port=false

# Quectel EC100S Module
ec100s.name=Quectel EC100S (ASR1601) LTE Cat.1 Module

# build
ec100s.build.core=logicrom
ec100s.build.cpu=arm
ec100s.build.f_cpu=416000000
ec100s.build.board=EC100S
ec100s.build.mcu=asr1601
ec100s.build.variant=asr160x
ec100s.build.vid=0x2ECC
ec100s.build.pid=0x3015
ec100s.build.flashsz=16M
ec100s.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1601=1 -DPLATFORM_EC100S=1
ec100s.build.logicromlib=logicromasr
ec100s.build.ldscript=linkerscript_asr.ld
ec100s.menu.debug.Release=Release
ec100s.menu.debug.Release.build.build_type=
ec100s.menu.debug.Debug=Debug
ec100s.menu.debug.Debug.build.build_type=_debug
ec100s.menu.stdio.none=None
ec100s.menu.stdio.none.build.stdio_port=
ec100s.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
ec100s.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
ec100s.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
ec100s.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
ec100s.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
ec100s.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
ec100s.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
ec100s.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
ec100s.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
ec100s.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
ec100s.upload.tool=logicromflasher_asr160x
ec100s.upload.protocol=logicromflasher
ec100s.upload.maximum_size=1048576
ec100s.upload.maximum_ram_size=524288
ec100s.upload.speed=460800
ec100s.upload.require_upload_port=false
ec100s.upload.wait_for_upload_port=false

# Quectel EC100Y Module
ec100s.name=Quectel EC100Y (ASR1601) LTE Cat.1 Module

# build
ec100s.build.core=logicrom
ec100s.build.cpu=arm
ec100s.build.f_cpu=416000000
ec100s.build.board=EC100Y
ec100s.build.mcu=asr1601
ec100s.build.variant=asr160x
ec100s.build.vid=0x2ECC
ec100s.build.pid=0x3015
ec100s.build.flashsz=16M
ec100s.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1601=1 -DPLATFORM_EC100Y=1
ec100s.build.logicromlib=logicromasr
ec100s.build.ldscript=linkerscript_asr.ld
ec100s.menu.debug.Release=Release
ec100s.menu.debug.Release.build.build_type=
ec100s.menu.debug.Debug=Debug
ec100s.menu.debug.Debug.build.build_type=_debug
ec100s.menu.stdio.none=None
ec100s.menu.stdio.none.build.stdio_port=
ec100s.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
ec100s.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
ec100s.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
ec100s.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
ec100s.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
ec100s.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
ec100s.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
ec100s.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
ec100s.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
ec100s.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

