waybyte/arduino_logicrom/boards.txt
# upload
eg912y.upload.tool=logicromflasher_asr160x
eg912y.upload.protocol=logicromflasher
eg912y.upload.maximum_size=524288
eg912y.upload.maximum_ram_size=524288
eg912y.upload.speed=460800
eg912y.upload.require_upload_port=false
eg912y.upload.wait_for_upload_port=false

# Quectel EG915N Module definition
eg915n.name=Quectel EG915N (ASR1603) LTE Cat.1 Module

# build
eg915n.build.core=logicrom
eg915n.build.cpu=arm
eg915n.build.f_cpu=416000000
eg915n.build.board=EG915N
eg915n.build.mcu=asr1603
eg915n.build.variant=asr160x
eg915n.build.vid=0x2ECC
eg915n.build.pid=0x3015
eg915n.build.flashsz=16M
eg915n.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1603=1 -DPLATFORM_EG915N=1
eg915n.build.logicromlib=logicromasr
eg915n.build.ldscript=linkerscript_asr.ld
eg915n.menu.debug.Release=Release
eg915n.menu.debug.Release.build.build_type=
eg915n.menu.debug.Debug=Debug
eg915n.menu.debug.Debug.build.build_type=_debug
eg915n.menu.stdio.none=None
eg915n.menu.stdio.none.build.stdio_port=
eg915n.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
eg915n.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
eg915n.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
eg915n.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
eg915n.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
eg915n.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
eg915n.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
eg915n.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
eg915n.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
eg915n.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
eg915n.upload.tool=logicromflasher_asr160x
eg915n.upload.protocol=logicromflasher
eg915n.upload.maximum_size=524288
eg915n.upload.maximum_ram_size=524288
eg915n.upload.speed=460800
eg915n.upload.require_upload_port=false
eg915n.upload.wait_for_upload_port=false

# SIMCOM A7670C Module
a7670.name=SIMCOM A7670C (ASR1601) LTE Cat.1 Module

# build
a7670.build.core=logicrom
a7670.build.cpu=arm
a7670.build.f_cpu=416000000
a7670.build.board=A7670C
a7670.build.mcu=asr1601
a7670.build.variant=asr160x
a7670.build.vid=0x2ECC
a7670.build.pid=0x3015
a7670.build.flashsz=16M
a7670.build.extra_flags=-DSOC_ASR160X=1 -DSOC_ASR1601=1 -DPLATFORM_A7670=1
a7670.build.logicromlib=logicromasr
a7670.build.ldscript=linkerscript_asr.ld
a7670.menu.debug.Release=Release
a7670.menu.debug.Release.build.build_type=
a7670.menu.debug.Debug=Debug
a7670.menu.debug.Debug.build.build_type=_debug
a7670.menu.stdio.none=None
a7670.menu.stdio.none.build.stdio_port=
a7670.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
a7670.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
a7670.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
a7670.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
a7670.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
a7670.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
a7670.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
a7670.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0
a7670.menu.stdio.ttyusb2=USB Uart 2 (/dev/ttyUSB1)
a7670.menu.stdio.ttyusb2.build.stdio_port=/dev/ttyUSB1

# upload
a7670.upload.tool=logicromflasher_asr160x
a7670.upload.protocol=logicromflasher
a7670.upload.maximum_size=1048576
a7670.upload.maximum_ram_size=524288
a7670.upload.speed=460800
a7670.upload.require_upload_port=false
a7670.upload.wait_for_upload_port=false

## MT2503/MT6261 based Boards
#############################

# Quectel M66
quectelm66.name=Quectel M66

# build
quectelm66.build.core=logicrom
quectelm66.build.cpu=arm
quectelm66.build.f_cpu=260000000
quectelm66.build.board=QUECTEL_M66TEA
quectelm66.build.mcu=mt6261
quectelm66.build.variant=m66
quectelm66.build.extra_flags=-DPLATFORM_M66=1
quectelm66.build.logicromlib=logicrom
quectelm66.build.ldscript=linkerscript.ld
quectelm66.menu.debug.Release=Release
quectelm66.menu.debug.Release.build.build_type=
quectelm66.menu.debug.Debug=Debug
quectelm66.menu.debug.Debug.build.build_type=_debug
quectelm66.menu.stdio.none=None
quectelm66.menu.stdio.none.build.stdio_port=
quectelm66.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
quectelm66.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
quectelm66.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
quectelm66.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
quectelm66.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
quectelm66.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2

# upload
quectelm66.bootloader.tool=logicromflasher
quectelm66.upload.tool=logicromflasher
quectelm66.upload.protocol=logicromflasher
quectelm66.upload.maximum_size=262144
quectelm66.upload.maximum_ram_size=96256
quectelm66.upload.speed=460800
quectelm66.upload.require_upload_port=true
quectelm66.upload.wait_for_upload_port=true

# Quectel MC60
quectelmc60.name=Quectel MC60

# build
quectelmc60.build.core=logicrom
quectelmc60.build.cpu=arm
quectelmc60.build.f_cpu=260000000
quectelmc60.build.board=QUECTEL_MC60TEA
quectelmc60.build.mcu=mt2503
quectelmc60.build.variant=mc60
quectelmc60.build.extra_flags=-DPLATFORM_MC60=1
quectelmc60.build.logicromlib=logicrom
quectelmc60.build.ldscript=linkerscript.ld
quectelmc60.menu.debug.Release=Release
quectelmc60.menu.debug.Release.build.build_type=
quectelmc60.menu.debug.Debug=Debug
quectelmc60.menu.debug.Debug.build.build_type=_debug
quectelmc60.menu.stdio.none=None
quectelmc60.menu.stdio.none.build.stdio_port=
quectelmc60.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
quectelmc60.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
quectelmc60.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
quectelmc60.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
quectelmc60.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
quectelmc60.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2

# upload
quectelmc60.bootloader.tool=logicromflasher
quectelmc60.upload.tool=logicromflasher
quectelmc60.upload.protocol=logicromflasher
quectelmc60.upload.maximum_size=262144
quectelmc60.upload.maximum_ram_size=96256
quectelmc60.upload.speed=460800
quectelmc60.upload.require_upload_port=true
quectelmc60.upload.wait_for_upload_port=true

# Quectel MC20
quectelmc20.name=Quectel MC20

# build
quectelmc20.build.core=logicrom
quectelmc20.build.cpu=arm
quectelmc20.build.f_cpu=260000000
quectelmc20.build.board=QUECTEL_MC20TEA
quectelmc20.build.mcu=mt2503
quectelmc20.build.variant=mc60
quectelmc20.build.extra_flags=-DPLATFORM_MC60=1
quectelmc20.build.logicromlib=logicrom
quectelmc20.build.ldscript=linkerscript.ld
quectelmc20.menu.debug.Release=Release
quectelmc20.menu.debug.Release.build.build_type=
quectelmc20.menu.debug.Debug=Debug
quectelmc20.menu.debug.Debug.build.build_type=_debug
quectelmc20.menu.stdio.none=None
quectelmc20.menu.stdio.none.build.stdio_port=
quectelmc20.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
quectelmc20.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
quectelmc20.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
quectelmc20.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
quectelmc20.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
quectelmc20.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2

