waybyte/arduino_logicrom/boards.txt
# upload
quectelmc20.bootloader.tool=logicromflasher
quectelmc20.upload.tool=logicromflasher
quectelmc20.upload.protocol=logicromflasher
quectelmc20.upload.maximum_size=262144
quectelmc20.upload.maximum_ram_size=96256
quectelmc20.upload.speed=460800
quectelmc20.upload.require_upload_port=true
quectelmc20.upload.wait_for_upload_port=true

# mc20u board definition
mc20u.name=Quectel MC20UCB

# build
mc20u.build.core=logicrom
mc20u.build.cpu=arm
mc20u.build.f_cpu=260000000
mc20u.build.board=SIWI_S20GSM
mc20u.build.mcu=mt2503
mc20u.build.variant=mc20u
mc20u.build.vid=0x0E8D
mc20u.build.pid=0x0003
mc20u.build.extra_flags=-DPLATFORM_MC20U=1
mc20u.build.logicromlib=logicrom
mc20u.build.ldscript=linkerscript.ld
mc20u.menu.debug.Release=Release
mc20u.menu.debug.Release.build.build_type=
mc20u.menu.debug.Debug=Debug
mc20u.menu.debug.Debug.build.build_type=_debug
mc20u.menu.stdio.none=None
mc20u.menu.stdio.none.build.stdio_port=
mc20u.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
mc20u.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
mc20u.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
mc20u.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
mc20u.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
mc20u.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
mc20u.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
mc20u.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
mc20u.bootloader.tool=logicromflasher
mc20u.upload.tool=logicromflasher
mc20u.upload.protocol=logicromflasher
mc20u.upload.maximum_size=262144
mc20u.upload.maximum_ram_size=96256
mc20u.upload.speed=460800
mc20u.upload.require_upload_port=true
mc20u.upload.wait_for_upload_port=true

# Quectel M56
quectelm56.name=Quectel M56

# build
quectelm56.build.core=logicrom
quectelm56.build.cpu=arm
quectelm56.build.f_cpu=260000000
quectelm56.build.board=QUECTEL_M56TEA
quectelm56.build.mcu=mt6261
quectelm56.build.variant=mc20u
quectelm56.build.extra_flags=-DPLATFORM_M56=1
quectelm56.build.logicromlib=logicrom
quectelm56.build.ldscript=linkerscript.ld
quectelm56.menu.debug.Release=Release
quectelm56.menu.debug.Release.build.build_type=
quectelm56.menu.debug.Debug=Debug
quectelm56.menu.debug.Debug.build.build_type=_debug
quectelm56.menu.stdio.none=None
quectelm56.menu.stdio.none.build.stdio_port=
quectelm56.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
quectelm56.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
quectelm56.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
quectelm56.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
quectelm56.menu.stdio.ttys2=Uart2 (/dev/ttyS2)
quectelm56.menu.stdio.ttys2.build.stdio_port=/dev/ttyS2
quectelm56.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
quectelm56.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
quectelm56.bootloader.tool=logicromflasher
quectelm56.upload.tool=logicromflasher
quectelm56.upload.protocol=logicromflasher
quectelm56.upload.maximum_size=262144
quectelm56.upload.maximum_ram_size=96256
quectelm56.upload.speed=460800
quectelm56.upload.require_upload_port=true
quectelm56.upload.wait_for_upload_port=true

# sim868 board definition
sim868.name=SIMCOM SIM868 GSM Module

# build
sim868.build.core=logicrom
sim868.build.cpu=arm
sim868.build.f_cpu=260000000
sim868.build.board=SIMCOM_SIM868
sim868.build.mcu=mt2503
sim868.build.variant=sim868
sim868.build.vid=0x0E8D
sim868.build.pid=0x0003
sim868.build.extra_flags=-DPLATFORM_SIM868=1
sim868.build.logicromlib=logicrom
sim868.build.ldscript=linkerscript.ld
sim868.menu.debug.Release=Release
sim868.menu.debug.Release.build.build_type=
sim868.menu.debug.Debug=Debug
sim868.menu.debug.Debug.build.build_type=_debug
sim868.menu.stdio.none=None
sim868.menu.stdio.none.build.stdio_port=
sim868.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
sim868.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
sim868.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
sim868.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
sim868.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
sim868.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
sim868.bootloader.tool=logicromflasher
sim868.upload.tool=logicromflasher
sim868.upload.protocol=logicromflasher
sim868.upload.maximum_size=262144
sim868.upload.maximum_ram_size=96256
sim868.upload.speed=460800
sim868.upload.require_upload_port=true
sim868.upload.wait_for_upload_port=true

## RDA8955 based Boards
#######################

# a9 board definition
a9.name=AI-Thinker A9 GSM Module

# build
a9.build.core=logicrom
a9.build.cpu=mips
a9.build.f_cpu=178000000L
a9.build.board=AITHINKER_A9
a9.build.mcu=rda8955
a9.build.variant=a9
a9.build.vid=0x1782
a9.build.pid=0x4D11
a9.build.extra_flags=-DSOC_RDA8955=1 -DPLATFORM_A9=1
a9.build.logicromlib=rda_logicrom
a9.build.ldscript=linkerscript_rda.ld
a9.menu.debug.Release=Release
a9.menu.debug.Release.build.build_type=
a9.menu.debug.Debug=Debug
a9.menu.debug.Debug.build.build_type=_debug
a9.menu.stdio.none=None
a9.menu.stdio.none.build.stdio_port=
a9.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
a9.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
a9.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
a9.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
a9.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
a9.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
a9.bootloader.tool=logicromflasher
a9.upload.tool=logicromflasher
a9.upload.protocol=logicromflasher
a9.upload.maximum_size=589824
a9.upload.maximum_ram_size=1040384
a9.upload.speed=460800
a9.upload.require_upload_port=false
a9.upload.wait_for_upload_port=false

# a9g board definition
a9g.name=AI-Thinker A9G GSM Module

# build
a9g.build.core=logicrom
a9g.build.cpu=mips
a9g.build.f_cpu=178000000L
a9g.build.board=AITHINKER_A9G
a9g.build.mcu=rda8955
a9g.build.variant=a9
a9g.build.vid=0x1782
a9g.build.pid=0x4D11
a9g.build.extra_flags=-DSOC_RDA8955=1 -DPLATFORM_A9G=1
a9g.build.logicromlib=rda_logicrom
a9g.build.ldscript=linkerscript_rda.ld
a9g.menu.debug.Release=Release
a9g.menu.debug.Release.build.build_type=
a9g.menu.debug.Debug=Debug
a9g.menu.debug.Debug.build.build_type=_debug
a9g.menu.stdio.none=None
a9g.menu.stdio.none.build.stdio_port=
a9g.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
a9g.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
a9g.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
a9g.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
a9g.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
a9g.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

