waybyte/arduino_logicrom/boards.txt
# upload
a9g.bootloader.tool=logicromflasher
a9g.upload.tool=logicromflasher
a9g.upload.protocol=logicromflasher
a9g.upload.maximum_size=589824
a9g.upload.maximum_ram_size=1040384
a9g.upload.speed=460800
a9g.upload.require_upload_port=false
a9g.upload.wait_for_upload_port=false

# MC65 board definition
mc65.name=Quectel MC65 GSM Module

# build
mc65.build.core=logicrom
mc65.build.cpu=mips
mc65.build.f_cpu=178000000L
mc65.build.board=QUECTEL_MC65
mc65.build.mcu=rda8955
mc65.build.variant=mc65
mc65.build.vid=0x1782
mc65.build.pid=0x4D11
mc65.build.extra_flags=-DSOC_RDA8955=1 -DPLATFORM_MC65=1
mc65.build.logicromlib=rda_logicrom
mc65.build.ldscript=linkerscript_rda.ld
mc65.menu.debug.Release=Release
mc65.menu.debug.Release.build.build_type=
mc65.menu.debug.Debug=Debug
mc65.menu.debug.Debug.build.build_type=_debug
mc65.menu.stdio.none=None
mc65.menu.stdio.none.build.stdio_port=
mc65.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
mc65.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
mc65.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
mc65.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1

# upload
mc65.bootloader.tool=logicromflasher
mc65.upload.tool=logicromflasher
mc65.upload.protocol=logicromflasher
mc65.upload.maximum_size=589824
mc65.upload.maximum_ram_size=1040384
mc65.upload.speed=460800
mc65.upload.require_upload_port=false
mc65.upload.wait_for_upload_port=false

# m590 board definition
m590.name=Neoway M590 GSM Module

# build
m590.build.core=logicrom
m590.build.cpu=mips
m590.build.f_cpu=178000000L
m590.build.board=AITHINKER_A9
m590.build.mcu=rda8955
m590.build.variant=m590
m590.build.vid=0x1782
m590.build.pid=0x4D11
m590.build.extra_flags=-DSOC_RDA8955=1 -DPLATFORM_M590=1
m590.build.logicromlib=rda_logicrom
m590.build.ldscript=linkerscript_rda.ld
m590.menu.debug.Release=Release
m590.menu.debug.Release.build.build_type=
m590.menu.debug.Debug=Debug
m590.menu.debug.Debug.build.build_type=_debug
m590.menu.stdio.none=None
m590.menu.stdio.none.build.stdio_port=
m590.menu.stdio.ttys0=Uart0 (/dev/ttyS0)
m590.menu.stdio.ttys0.build.stdio_port=/dev/ttyS0
m590.menu.stdio.ttys1=Uart1 (/dev/ttyS1)
m590.menu.stdio.ttys1.build.stdio_port=/dev/ttyS1
m590.menu.stdio.ttyusb=USB Uart 1 (/dev/ttyUSB0)
m590.menu.stdio.ttyusb.build.stdio_port=/dev/ttyUSB0

# upload
m590.bootloader.tool=logicromflasher
m590.upload.tool=logicromflasher
m590.upload.protocol=logicromflasher
m590.upload.maximum_size=589824
m590.upload.maximum_ram_size=1040384
m590.upload.speed=460800
m590.upload.require_upload_port=false
m590.upload.wait_for_upload_port=false
